#Напишите код, который принимает три целых числа и печатает их сумму. Каждое число принимается
#на отдельной строке.
a = int(input("First number?"))
b = int(input("Second number?"))
c = int(input("Third number?"))
print(a+b+c)
