# Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько слов имеет данная
# строка.
s = "Hello all the world !"
print(s.count(' '))