#Напишите код, который принимает значения основания и высоты прямоугольного треугольника и
#печатает его площадь. Каждое число принимается на отдельной строке
a = int(input("Triangle base length ?"))
b = int(input("Triangle height ?"))
print("Triangle area equals to {}".format(a * 0.5 * b))