# Дана какая-то строка. Замените в этой строке все числа 1 словом 'one'.
# Напечатайте изменённую строку

s = "1 + 1 = 2"
s1 = s.replace("1", "one")
print(s1)