# Дана строка. Удалите все символы '@' из этой строки.
# Напечатайте изменённую строку

s = "shaman4d@gmail.com"
s1 = s.replace('@', '')
print(s1)