# Дано целое положительное число.
# Напечатайте "чёт", если число чётное и "нечет", если число нечётное.

num = 3
print( 'чет' if num % 2 == 0 else 'нечет')
