# Дано целое число
# Напечатайте 1, если число положительное; -1, если число отрицательное; 0, если это число ноль.

n = 179
print(1 if n > 0 else -1 if n < 0 else 0)