# Даны два целых числа отличные от числа 0.
# Напечатайте "Да", если хотя бы одно число является положительным и "Нет", если оба числа
# отрицательные.

n0 = -179
n1 = -180
print("No" if n0 < 0 and n1 < 0 else "Yes")