#Напишите код, который принимает имя пользователя и печатает фразу состоящую из слов "Привет",
#запятой, имени пользователя и восклицательного знака
print('Hello {}!'.format(input('Your name ?')))