#Напишите код, который принимает целое число и печатает числа, которые следуют до него и после него.
a = int(input("Number ?"))
print ("Previos number is {}".format(a-1))
print ("Next number is {}".format(a+1))